import math
from datetime import datetime

# :< n 、:> n 、:^ n 
# 指定した幅（ｎ）で左寄せ、右寄せ、中央揃え

value = 'left'
print(f'{value}:<30の実行結果：{value:<30}')
print('------------------------------------------------------')

value = 'right'
print(f'{value}:>30の実行結果：{value:>30}')
print('------------------------------------------------------')

value = 'center'
print(f'{value}:^30の実行結果：{value:^30}')
print('------------------------------------------------------')

# :-< n 、:-> n、:-^ n
# 左寄せ、右寄せ、中央ぞろえでスペースの代わりに指定した文字列（例では「-」）で埋める
print(f'{value}:-^30の実行結果：{value:-^30}')
print('------------------------------------------------------')

# :b、:o、:d 、:x 、:X
# 2進数、8進数、10進数、16進数（小文字）、16進数（大文字）に変換する
value = 1000
print(f'{value}の2進数：{value:b}|8進数：{value:o}|10進数：{value:d}|16進数（小文字）{value:x}|16進数（大文字）：{value:X}')
print('------------------------------------------------------')

# :f 固定小数点の文字列に変換
print(f'math.pi:fの実行結果：{math.pi:f}')
print('------------------------------------------------------')

# :% 百分率での表記に変換
value = 0.045
print(f'{value}の:%の実行結果：{value:%}')
print('------------------------------------------------------')

# :, 数値の３桁ごとにカンマを挿入
value = 100000000000
print(f'{value}の:,の実行結果：{value:,}')
print('------------------------------------------------------')

# :6.2f 表示する桁数を指定
# 上記では６は全体の桁数、２は小数点以下の桁数を表す
print(f'math.pi:>5.2fの実行結果：{math.pi:>5.2f}')
print('------------------------------------------------------')

# :%Y-%m-%d %H:%M:%S 
# 日付型特有の書式で年月費などに変換
now = datetime.now()
print(f'{now}の:%Y-%m-%dの実行結果：{now:%Y-%m-%d}')
print('------------------------------------------------------')
print(f'{now}の:%H:%M:%Sの実行結果：{now:%H:%M:%S}')
print('------------------------------------------------------')
